Repository: OpenIndiana/oi-userland
Catalog: components/desktop/gnome2/gnome-netstatus/files/po-sun/*.po
Languages: es, fr, ja, pt_br, zh_cn

source: IP Address (v4)
es: Dirección IP (v 4)
fr: Adresse IP (v4)
ja: IP アドレス (v4)
pt_br: Endereço IP (v4)
zh_cn: IP 地址 (v4)

source: Wireless Network
es: Red inalámbrica
fr: Réseau sans fil
ja: 無線ネットワーク
pt_br: Rede sem fio
zh_cn: 无线网络

source: <b>Wireless</b>
es: <b>Inalámbrico</b>
fr: <b>Sans fil</b>
ja: <b>無線</b>
pt_br: <b>Sem fio</b>
zh_cn: <b>无线</b>

source: Access Point (BSSID):
es: Punto de acceso (BSSID):
fr: Point d'accès (BSSID) :
ja: アクセスポイント (BSSID):
pt_br: Ponto de acesso (BSSID):
zh_cn: 访问点 (BSSID)：

source: Authentication Mode:
es: Modo de autenticación:
fr: Mode d'authentification :
ja: 認証モード:
pt_br: Modo de autenticação:
zh_cn: 验证模式：

source: Configure network _automatically
es: Configurar red _automáticamente
fr: Configurer le réseau _automatiquement
ja: ネットワークの自動設定(_A)
pt_br: Configurar rede _automaticamente
zh_cn: 自动配置网络(_A)

source: Network Name (ESSID):
es: Nombre de red (ESSID):
fr: Nom de réseau (ESSID) :
ja: ネットワーク名 (ESSID):
pt_br: Nome da rede (ESSID):
zh_cn: 网络名称 (ESSID)：

source: Operational Mode (BSS):
es: Modo operativo (BSS):
fr: Mode opérationnel (BSS) :
ja: 動作モード (BSS):
pt_br: Modo operacional (BSS):
zh_cn: 操作模式 (BSS)：

source: Restart
es: Reiniciar
fr: Redémarrer
ja: 再起動
pt_br: Reiniciar
zh_cn: 重新启动

source: Security:
es: Seguridad:
fr: Sécurité :
ja: セキュリティー:
pt_br: Segurança:
zh_cn: 安全：

source: Signal Strength:
es: Potencia de la señal:
fr: Intensité du signal:
ja: シグナル強度:
pt_br: Intensidade do sinal:
zh_cn: 信号强度:

source: You may need to restart the connection if you want to connect to a different network, or if you are experiencing connection problems.
es: Quizá deba reiniciar la conexión si tiene problemas de conexión o si desea conectarse a otra red.
fr: Pour vous connecter à un autre réseau ou en cas de problème de connexion, vous devrez peut-être relancer la connexion.
ja: 別のネットワークに接続する場合、または接続の問題が発生している場合は、接続の再起動が必要になることがあります。
pt_br: Talvez seja necessário reiniciar esta conexão se desejar conectar-se a outra rede ou se tiver problemas de conexão.
zh_cn: 如果要连接到不同的网络，或者出现了连接问题，则可能需要重新启动连接。

source: _Restart
es: _Reiniciar
fr: _Redémarrer
ja: 再起動(_R)
pt_br: _Reiniciar
zh_cn: 重新启动(_R)

source: _Track system active interface
es: _Efectuar seguimiento de interfaz activa del sistema
fr: Interface ac_tive du système de suivi
ja: システムのアクティブインタフェースの追跡(_T)
pt_br: _Controlar interface ativa do sistema
zh_cn: 跟踪系统活动接口(_T)

source: You have selected that the network be automatically configured.
es: Ha seleccionado que la red se configure automáticamente.
fr: Vous avez sélectionné la configuration automatique du réseau.
ja: ネットワークの自動設定を選択しました。
pt_br: Você selecionou que a rede seja configurada automaticamente.
zh_cn: 您选择了自动配置网络。

source: You have selected to manually configure the network..
es: Ha seleccionado que la red se configure manualmente.
fr: Vous avez sélectionné la configuration manuelle du réseau.
ja: ネットワークの手動設定を選択しました。
pt_br: Você selecionou que a rede seja configurada manualmente.
zh_cn: 您选择了手动配置网络。

source: This will cause your network to be restarted Do you wish to continue?
es: Eso hará que se deba reiniciar la red ¿Desea continuar?
fr: L'opération entraînera le redémarrage du réseau Souhaitez-vous continuer ?
ja: これにより、ネットワークが再起動されます 続行しますか?
pt_br: Isso fará com que a rede seja reiniciada Deseja continuar?
zh_cn: 这将会导致网络重新启动 是否要继续？

source: Signal Strength
es: Potencia de la señal
fr: Intensité du signal
ja: シグナル強度
pt_br: Intensidade do sinal
zh_cn: 信号强度

source: Operational Mode
es: Modo operativo
fr: Mode opérationnel
ja: 動作モード
pt_br: Modo operacional
zh_cn: 操作模式

source: Track Active Interface
es: Efectuar seguimiento de interfaz activa
fr: Interface active de suivi
ja: アクティブインタフェースの追跡
pt_br: Controlar interface ativa
zh_cn: 跟踪活动接口

source: Whether to track the system's active interface
es: Si se efectúa o no el seguimiento de la interfaz activa del sistema
fr: Si le suivi de l'interface active du système doit être effectué
ja: システムのアクティブインタフェースを追跡するかどうか
pt_br: Se a interface ativa do sistema será controlada
zh_cn: 是否跟踪系统的活动接口

source: Wireless ESSID
es: ESSID inalámbrico
fr: ESSID sans fil
ja: 無線 ESSID
pt_br: ESSID sem fio
zh_cn: 无线 ESSID

source: Wireless BSSID
es: BSSID inalámbrico
fr: BSSID sans fil
ja: 無線 BSSID
pt_br: BSSID sem fio
zh_cn: 无线 BSSID

source: BSS_MODE
fr: MODE_BSS

source: Wireless BSS_Mode
es: BSS_Mode inalámbrico
fr: MODE_BSS sans fil
ja: 無線 BSS_Mode
pt_br: BSS_Mode sem fio
zh_cn: 无线 BSS_Mode

source: Wireless CONNECTED
es: Inalámbrico CONECTADO
fr: CONNECTÉ sans fil
ja: 無線が接続されています
pt_br: Sem fio CONECTADO
zh_cn: 无线已连接

source: Whether the interface is connected
es: Si la interfaz está o no conectada
fr: Si l'interface est connectée
ja: インタフェースが接続されているかどうか
pt_br: Se a interface está conectada
zh_cn: 是否连接了接口

source: Wireless MODE
es: MODE inalámbrico
fr: MODE sans fil
ja: 無線モード
pt_br: MODE sem fio
zh_cn: 无线模式

source: SECURITY
fr: SÉCURITÉ
ja: セキュリティー
zh_cn: 安全

source: Wireless SECURITY
es: SECURITY inalámbrica
fr: SÉCURITÉ sans fil
ja: 無線セキュリティー
pt_br: SECURITY sem fio
zh_cn: 无线安全

source: AUTH_MODE
fr: MODE_AUTH

source: Wireless AUTH_MODE
es: AUTH_MODE inalámbrico
fr: MODE_AUTH sans fil
ja: 無線 AUTH_MODE
pt_br: AUTH_MODE sem fio
zh_cn: 无线 AUTH_MODE

source: Computer-to-Computer (Ad Hoc)
es: De equipo a equipo (ad hoc)
fr: Ordinateur à ordinateur (ad hoc)
ja: コンピュータからコンピュータへ (アドホック)
pt_br: Computador-a-Computador (Ad Hoc)
zh_cn: 计算机到计算机（特定）

source: Any
es: Cualquiera
fr: Tous
ja: 任意
pt_br: Qualquer
zh_cn: 任何

source: None
es: Ninguno
fr: Aucun
ja: なし
pt_br: Nenhum
zh_cn: 无

source: Open
es: Abierto
fr: Ouvert
ja: 公開
pt_br: Abrir
zh_cn: 打开

source: Shared
es: Compartida
fr: Partagée
ja: 共有
pt_br: Compartilhada
zh_cn: 共享

source: MODE
ja: モード
zh_cn: 模式

source: Infrastructure
es: Infraestructura
ja: インフラストラクチャー
pt_br: Infra-estrutura
zh_cn: 基础结构
