OpenIndiana/oi-userland/components/mail/sendmail/files/man/makemap.8
'\" te
.\" Copyright (c) 1983 Eric P. Allman
.\" Copyright (c) 1988, 1993 The Regents of the University of California.  All rights reserved.
.\" Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright    notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright    notice, this list of conditions and the following disclaimer in the    documentation and/or other materials provided with the distribution. 3. All advertising materials mentioning features or use of this software    must display the following acknowledgement: This product includes software developed by the University of California, Berkeley and its contributors. 4. Neither the name of the University nor the names of its contributors    may be used to endorse or promote products derived from this software    without specific prior written permission.  THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\" Copyright (c) 1998-2006, 2008 Sendmail, Inc. and its suppliers.  All rights reserved.
.\" The following license terms and conditions apply, unless a different license is obtained from Sendmail, Inc., 6425 Christie Ave, Fourth Floor, Emeryville, CA 94608, USA, or by electronic mail at license@sendmail.com.  License Terms:  Use, Modification and Redistribution (including distribution of any modified or derived work) in source and binary forms is permitted only if each of the following conditions is met:  1. Redistributions qualify as "freeware" or "Open Source Software" under    one of the following terms:     (a) Redistributions are made at no charge beyond the reasonable cost of        materials and delivery.     (b) Redistributions are accompanied by a copy of the Source Code or by an        irrevocable offer to provide a copy of the Source Code for up to three       years at the cost of materials and delivery.  Such redistributions        must allow further use, modification, and redistribution of the Source       Code under substantially the same terms as this license.  For the        purposes of redistribution "Source Code" means the complete compilable       and linkable source code of sendmail including all modifications.  2. Redistributions of source code must retain the copyright notices as they    appear in each source code file, these license terms, and the    disclaimer/limitation of liability set forth as paragraph 6 below.  3. Redistributions in binary form must reproduce the Copyright Notice,    these license terms, and the disclaimer/limitation of liability set    forth as paragraph 6 below, in the documentation and/or other materials    provided with the distribution.  For the purposes of binary distribution    the "Copyright Notice" refers to the following language:    "Copyright (c) 1998-2004 Sendmail, Inc.  All rights reserved."  4. Neither the name of Sendmail, Inc. nor the University of California nor    the names of their contributors may be used to endorse or promote    products derived from this software without specific prior written    permission.  The name "sendmail" is a trademark of Sendmail, Inc.  5. All redistributions must comply with the conditions imposed by the    University of California on certain embedded code, whose copyright    notice and conditions for redistribution are as follows:     (a) Copyright (c) 1988, 1993 The Regents of the University of        California.  All rights reserved.     (b) Redistribution and use in source and binary forms, with or without        modification, are permitted provided that the following conditions        are met:        (i)   Redistributions of source code must retain the above copyright             notice, this list of conditions and the following disclaimer.        (ii)  Redistributions in binary form must reproduce the above             copyright notice, this list of conditions and the following             disclaimer in the documentation and/or other materials provided             with the distribution.        (iii) Neither the name of the University nor the names of its             contributors may be used to endorse or promote products derived             from this software without specific prior written permission. 6. Disclaimer/Limitation of Liability: THIS SOFTWARE IS PROVIDED BY    SENDMAIL, INC. AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED    WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN    NO EVENT SHALL SENDMAIL, INC., THE REGENTS OF THE UNIVERSITY OF    CALIFORNIA OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,    INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT    NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF    USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON    ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF    THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
.\" Copyright (c) 2008, 2016, Oracle and/or its affiliates. All rights reserved.
.TH makemap 8 "8 Mar 2016" "SunOS 5.12" "System Administration Commands"
.SH NAME
makemap \- create database maps for sendmail
.SH SYNOPSIS
.LP
.nf
\fBmakemap\fR [\fB-N\fR] [\fB-d\fR] [\fB-f\fR] [\fB-o\fR] [\fB-r\fR] [\fB-s\fR] [\fB-v\fR] [\fB-C\fR \fIfile\fR] 
     [\fB-c\fR \fIcachesize\fR] [\fB-D\fR \fIcommentchar\fR] [\fB-e\fR] [\fB-l\fR] [\fB-t\fR \fIdelim\fR] 
     [\fB-u\fR] \fImantype\fR \fImapname\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBmakemap\fR creates the database maps used by the keyed map lookups in \fBsendmail\fR(8). \fBmakemap\fR reads from the standard input and outputs to the specified \fImapname\fR. 
.sp
.LP
In all cases, \fBmakemap\fR reads lines from the standard input consisting of two words separated by whitespace. The first is the database key, the second is the value. The value may contain \fB%\fR\fIn\fR strings to indicated parameter substitution. Literal percents should be doubled (\fB%%\fR). Blank lines and lines beginning with \fB#\fR are ignored.
.sp
.LP
\fBmakemap\fR handles three different database formats. Database format is selected using the \fImaptype\fR parameter. See \fBOPERANDS\fR. 
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIcachesize\fR\fR
.ad
.RS 18n
.rt  
Use the specified hash and B-Tree cache size (\fIcachesize\fR).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-C\fR \fIfile\fR\fR
.ad
.RS 18n
.rt  
Use the specified sendmail configuration file (\fIfile\fR) for looking up the TrustedUser option.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR\fR
.ad
.RS 18n
.rt  
Allow duplicate keys in the map. This is only allowed on B-Tree format maps. If two identical keys are read, both be inserted into the map.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-D\fR \fIcommentchar\fR\fR
.ad
.RS 18n
.rt  
Use the specified character to indicate a comment (which is ignored) instead of the default of '\fB#\fR'.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR\fR
.ad
.RS 18n
.rt  
Allow empty value (right hand side).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.RS 18n
.rt  
Normally, all upper case letters in the key are folded to lower case. This flag disables that behavior. This is intended to mesh with the \fB-f\fR flag in the \fBK\fR line in \fBsendmail.cf\fR. The value is never case folded.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-l\fR\fR
.ad
.RS 18n
.rt  
List supported map types.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-N\fR\fR
.ad
.RS 18n
.rt  
Include the null byte that terminates strings in the map. This must match the \fB-N\fR flag in the \fBK\fR line in \fBsendmail.cf\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-o\fR\fR
.ad
.RS 18n
.rt  
Append to an old file. This allows you to augment an existing file.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR\fR
.ad
.RS 18n
.rt  
Allow replacement of existing keys. Normally \fBmakemap\fR complains if you repeat a key, and does not do the insert.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.RS 18n
.rt  
Ignore safety checks on maps being created. This includes checking for hard or symbolic links in world writable directories.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIdelim\fR\fR
.ad
.RS 18n
.rt  
Use the specified delimiter (\fIdelim\fR) instead of whitespace.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR\fR
.ad
.RS 18n
.rt  
Dump (unmap) the content of the database to standard output. Note that, if the \fB-t\fR option is also provided, the specified delimiter is used when the content is dumped instead of whitespace.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.RS 18n
.rt  
Verbosely print what it is doing.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fImapname\fR\fR
.ad
.RS 11n
.rt  
File name of the database map being created.
.RE

.sp
.ne 2
.mk
.na
\fB\fImaptype\fR\fR
.ad
.RS 11n
.rt  
Specifies the database format. The following \fImaptype\fR parameters are available: 
.sp
.ne 2
.mk
.na
\fB\fBdbm\fR\fR
.ad
.RS 9n
.rt  
Specifies \fBDBM\fR format maps.
.RE

.sp
.ne 2
.mk
.na
\fB\fBbtree\fR\fR
.ad
.RS 9n
.rt  
Specifies B-Tree format maps.
.RE

.sp
.ne 2
.mk
.na
\fB\fBhash\fR\fR
.ad
.RS 9n
.rt  
Specifies hash format maps.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/smtp/sendmail
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(7), \fBeditmap\fR(8), \fBsendmail\fR(8)
