OpenIndiana/oi-userland/components/ntp/manpages/ntpdc.1m
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\"
.\" Copyright (c) 2009, 2011, Oracle and/or its affiliates. All rights reserved.
.\"
.TH "ntpdc" "1M" "" "" "System Administration Commands"
.SH NAME
ntpdc \- Network Time Protocol special query program
.SH SYNOPSIS
.LP
.B /usr/sbin/ntpdc
[\fB-46lpsidnv?!\fR] [\fB-c\fR \fIcommand\fR] [\fB-D\fR \fIdebuglvl\fR]
[\fB-<\fR \fIoptfile\fR] [\fB->\fR \fIoptfile\fR]  [\fIhost\fR] [...]
.fi
.SH "OPTIONS"
Specifying a command line option other than \fB-i\fP or \fB-n\fP will cause the specified query (queries) to be sent to the indicated host(s) immediately. Otherwise, \fBntpdc\fP will attempt to read interactive format commands from the standard input.
.LP
.TP
.BR "-4"
Force DNS resolution of following host names on the command line to the IPv4 namespace.
.TP
.BR "-6"
Force DNS resolution of following host names on the command line to the IPv6 namespace.
.TP
.BR "-c \fIcommand\fP"
The argument \fIcommand\fP is interpreted as an interactive command and is added to the list of commands to be executed on the specified host(s). Multiple -c options may be given.
.TP
.BR "-i"
Force \fBntpdc\fP to operate in interactive mode. Prompts will be written to the standard output and commands read from the standard input.
.TP
.BR "-l"
Obtain a list of peers which are known to the server(s). This switch is equivalent to \fB-c listpeers\fP.
.TP
.BR "-n"
Output all host addresses in numeric format rather than converting to the canonical host names.
.TP
.BR "-p"
Print a list of the peers known to the server as well as a summary of their state. This is equivalent to \fB-c peers\fP.
.TP
.BR "-s"
Print a list of the peers known to the server as well as a summary of their state, but in a slightly different format than the -p switch. This is equivalent to \fB-c dmpeers\fP.
.SH "DESCRIPTION"
\fBntpdc\fP is used to query the \fBntpd\fP daemon about its current state and to request changes in that state. The program may be run either in interactive mode or controlled using command line arguments. Extensive state and statistics information is available through the \fBntpdc\fP interface. In addition, nearly all the configuration options which can be specified at startup using ntpd's configuration file may also be specified at run time using \fBntpdc\fP.
If one or more request options are included on the command line when \fBntpdc\fP is executed, each of the requests will be sent to the NTP servers running on each of the hosts given as command line arguments, or on localhost by default. If no request options are given, \fBntpdc\fP will attempt to read commands from the standard input and execute these on the NTP server running on the first host given on the command line, again defaulting to localhost when no other host is specified. \fBntpdc\fP will prompt for commands if the standard input is a terminal device.
.LP
\fBntpdc\fP uses NTP mode 7 packets to communicate with the NTP server, and hence can be used to query any compatible server on the network which permits it. Note that since NTP is a UDP protocol this communication will be somewhat unreliable, especially over large distances in terms of network topology. \fBntpdc\fP makes no attempt to retransmit requests, and will time requests out if the remote host is not heard from within a suitable timeout time.
.LP
The operation of \fBntpdc\fP are specific to the particular implementation of the \fBntpd\fP daemon and can be expected to work only with this and maybe some previous versions of the daemon. Requests from a remote \fBntpdc\fP program which affect the state of the local server must be authenticated, which requires both the remote program and local server share a common key and key identifier.
.LP
Note that in contexts where a host name is expected, a \fB-4\fP qualifier preceding the host name forces DNS resolution to the IPv4 namespace, while a \fB-6\fP qualifier forces DNS resolution to the IPv6 namespace.
.LP
.SS "Interactive Commands"
Interactive format commands consist of a keyword followed by zero to four arguments. Only enough characters of the full keyword to uniquely identify the command need be typed. The output of a command is normally sent to the standard output, but optionally the output of individual commands may be sent to a file by appending a \fB>\fP, followed by a file name, to the command line.
.LP
A number of interactive format commands are executed entirely within the \fBntpdc\fP program itself and do not result in NTP mode 7 requests being sent to a server. These are described following.
.LP
.TP
.BR "? [ \fIcommand_keyword\fP ], help [ \fIcommand_keyword\fP ]"
A \fB?\fP by itself will print a list of all the command keywords known to this incarnation of \fBntpq\fP. A \fB?\fP followed by a command keyword will print function and usage information about the command. This command is probably a better source of information about \fBntpq\fP than this manual page.
.TP
.BR "delay \fImilliseconds\fP"
Specify a time interval to be added to timestamps included in requests which require authentication. This is used to enable (unreliable) server reconfiguration over long delay network paths or between machines whose clocks are unsynchronized. Actually the server does not now require timestamps in authenticated requests, so this command may be obsolete.
.TP
.BR "host \fIhostname\fP"
Set the host to which future queries will be sent. Hostname may be either a host name or a numeric address.
.TP
.BR "hostnames [ yes | no ]"
If \fByes\fP is specified, host names are printed in information displays. If \fBno\fP is specified, numeric addresses are printed instead. The default is \fByes\fP, unless modified using the command line \fB-n\fP switch.
.TP
.BR "keyid \fIkeyid\fP"
This command allows the specification of a
key number to be used to authenticate configuration
requests from ntpdc to the host(s). This must
correspond to a key number which the host/server has
been configured to use for this purpose (server
options: \fBtrustedkey\fP, and
\fBrequestkey\fP).  If authentication is not
enabled on the host(s) for ntpdc
commands, the command
\fB"keyid 0"\fP should be given; otherwise the
\fIkeyid\fP of the next subsequent \fBaddpeer/addserver/broadcast
\fP command will
be used.  
.TP
.BR "quit"
.TP
.BR "exit"
Exit \fBntpdc\fP.
.TP
.BR "debug [ no | more | less ]"
With no parameter displays the current \fBntpdc\fP debug level. The \fBno\fP flag turns off all debugging, 
while \fBmore\fP and \fBless\fP increase and decrease the level respectively.
.TP
.BR "passwd"
This command prompts you to type in a password (which will not be echoed) which will be used to authenticate configuration requests. The password must correspond to the key configured for use by the NTP server for this purpose if such requests are to be successful.
.TP
.BR "timeout \fImilliseconds\fP"
Specify a timeout period for responses to server queries. The default is about 8000 milliseconds. Note that since \fBntpdc\fP retries each query once after a timeout, the total waiting time for a timeout will be twice the timeout value set.
.TP
.BR "version"
Display the version of the \fBntpdc\fP command.
.SS "Control Message Commands"
Query commands result in NTP mode 7 packets containing requests for information being sent to the server. These are read-only commands in that they make no modification of the server configuration state.
.LP
.TP
.BR "listpeers"
Obtains and prints a brief list of the peers for which the server is maintaining state. These should include all configured peer associations as well as those peers whose stratum is such that they are considered by the server to be possible future synchronization candidates.
.TP
.BR "peers"
Obtains a list of peers for which the server is maintaining state, along with a summary of that state. Summary information includes the address of the remote peer, the local interface address (0.0.0.0 if a local address has yet to be determined), the stratum of the remote peer (a stratum of 16 indicates the remote peer is unsynchronized), the polling interval, in seconds, the reachability register, in octal, and the current estimated delay, offset and dispersion of the peer, all in seconds.
The character in the left margin indicates the mode this peer entry is operating in. A \fB+\fP denotes symmetric active, a \fB-\fP indicates symmetric passive, a \fB=\fP means the remote server is being polled in client mode, a \fB^\fP indicates that the server is broadcasting to this address, a \fB~\fP denotes that the remote peer is sending broadcasts and a \fB*\fP marks the peer the server is currently synchronizing to.
The contents of the host field may be one of four forms. It may be a host name, an IP address, a reference clock implementation name with its parameter or
.BR "REFCLK(\fIimplementation number\fP, \fIparameter\fP)".
If the "\fBhostnames no\fP" command has been given only IP-addresses will be displayed.
.LP
.TP
.BR "dmpeers"
A slightly different peer summary list. Identical to the output of the \fBpeers\fP command, except for the character in the leftmost column. Characters only appear beside peers which were included in the final stage of the clock selection algorithm. A \fB.\fP indicates that this peer was cast off in the falseticker detection, while a \fB+\fP indicates that the peer made it through. A \fB*\fP denotes the peer the server is currently synchronizing with.
.TP
.BR "showpeer \fIpeer_address\fP [...]"
Shows a detailed display of the current peer variables for one or more peers. Most of these values are described in the NTP Version 2 specification.
.TP
.BR "pstats \fIpeer_address\fP [...]"
Show per-peer statistic counters associated with the specified peer(s).
.TP
.BR "clockstat \fIclock_peer_address\fP [...]"
Obtain and print information concerning a peer clock. The values obtained provide information on the setting of fudge factors and other clock performance information.
.TP
.BR "kerninfo"
Obtain and print kernel phase-lock loop operating parameters. This information is available if the host supports the \fBntp_adjtime\fP system call.
.TP
.BR "loopinfo [ oneline | multiline ]"
Print the values of selected loop filter variables. The loop filter is the part of NTP which deals with adjusting the local system clock. The \fBoffset\fP is the last offset given to the loop filter by the packet processing code. The \fBfrequency\fP is the frequency error of the local clock in parts-per-million (ppm). The \fBtime_const\fP controls the stiffness of the phase-lock loop and thus the speed at which it can adapt to oscillator drift. The \fBwatchdog timer\fP value is the number of seconds which have elapsed since the last sample offset was given to the loop filter. The \fBoneline\fP and \fBmultiline\fP options specify the format in which this information is to be printed, with \fBmultiline\fP as the default.
.TP
.BR "sysinfo"
Print a variety of system state variables, i.e., state related to the local server. All except the last four lines are described in the NTP Version 3 specification, RFC-1305.
The \fBsystem flags\fP show various system flags, some of which can be set and cleared by the \fBenable\fP and \fBdisable\fP configuration commands, respectively. These are the \fBauth\fP, \fBbclient\fP, \fBmonitor\fP, \fBpll\fP, \fBpps\fP and \fBstats\fP flags. See the \fBntpd\fP documentation for the meaning of these flags. There are two additional flags which are read only, the \fBkernel_pll\fP and \fBkernel_pps\fP. These flags indicate the synchronization status when the precision time kernel modifications are in use. The \fBkernel_pll\fP indicates that the local clock is being disciplined by the kernel, while the kernel_pps indicates the kernel discipline is provided by the PPS signal.
The \fBstability\fP is the residual frequency error remaining after the system frequency correction is applied and is intended for maintenance and debugging. In most architectures, this value will initially decrease from as high as 500 ppm to a nominal value in the range .01 to 0.1 ppm. If it remains high for some time after starting the daemon, something may be wrong with the local clock, or the value of the kernel variable \fBtick\fP may be incorrect.
The \fBbroadcastdelay\fP shows the default broadcast delay, as set by the \fBbroadcastdelay\fP configuration command.
The \fBauthdelay\fP shows the default authentication delay, as set by the \fBauthdelay\fP configuration command.
.TP
.BR "sysstats"
Print statistics counters maintained in the protocol module.
.TP
.BR "ctlstats"
Print statistics counters maintained in the control module.
.TP
.BR "memstats"
Print statistics counters related to memory allocation code.
.TP
.BR "iostats"
Print statistics counters maintained in the input-output module.
.TP
.BR "timerstats"
Print statistics counters maintained in the timer/event queue support code.
.TP
.BR "reslist"
Obtain and print the server's restriction list. This list is (usually) printed in sorted order and may help to understand how the restrictions are applied.
.TP
.BR "ifstats"
List interface statistics for interfaces used by ntpd for network communication.
.TP
.BR "ifreload"
Force rescan of current system interfaces. Outputs interface statistics for interfaces that could possibly change. Marks unchanged interfaces with \fB.\fP, added interfaces with \fB+\fP and deleted interfaces with \fB-\fP.
.TP
.BR "monlist [ \fIversion\fP ]"
Obtain and print traffic counts collected and maintained by the monitor facility. The version number should not normally need to be specified.
.TP
.BR "clkbug \fIclock_peer_address\fP [...]"
Obtain debugging information for a reference clock driver. This information is provided only by some clock drivers and is mostly undecodable without a copy of the driver source in hand.
.SS "Runtime Configuration Requests"
All requests which cause state changes in the server are authenticated by the server using a configured NTP key (the facility can also be disabled by the server by not configuring a key). The key number and the corresponding key must also be made known to \fBntpdc\fP. This can be done using the \fBkeyid\fP and \fBpasswd\fP commands, the latter of which will prompt at the terminal for a password to use as the encryption key. You will also be prompted automatically for both the key number and password the first time a command which would result in an authenticated request to the server is given. Authentication not only provides verification that the requester has permission to make such changes, but also gives an extra degree of protection against transmission errors.
.LP
Authenticated requests always include a timestamp in the packet data, which is included in the computation of the authentication code. This timestamp is compared by the server to its receive time stamp. If they differ by more than a small amount the request is rejected. This is done for two reasons. First, it makes simple replay attacks on the server, by someone who might be able to overhear traffic on your LAN, much more difficult. Second, it makes it more difficult to request configuration changes to your server from topologically remote hosts. While the reconfiguration facility will work well with a server on the local host, and may work adequately between time-synchronized hosts on the same LAN, it will work very poorly for more distant hosts. As such, if reasonable passwords are chosen, care is taken in the distribution and protection of keys and appropriate source address restrictions are applied, the run time reconfiguration facility should provide an adequate level of security.
.LP
The following commands all make authenticated requests.
.LP
.TP
.BR "addpeer \fIpeer_address\fP [ \fIkeyid\fP ] [ \fIversion\fP ] "
.BR "[ \fIminpoll#\fP | prefer | iburst  | burst | minpoll \fIN\fP | \fBmaxpoll\fP \fIN\fP [ \fIdynamic\fP ] [...] ]\fP"
.TP
.BR "addpeer \fIpeer_address\fP [ \fBprefer | iburst | burst | minpoll \fIN\fP"
.BR "| \fBmaxpoll\fP \fIN\fP | \fBkeyid\fP \fIN\fP | \fBversion\fP \fIN\fP [...] ]"
.sp
Add a configured peer association at the
given address and operating in symmetric
active mode. Note that an existing association
with the same peer may be deleted when this
command is executed, or may simply be
converted to conform to the new configuration,
as appropriate. If the \fBkeyid\fP
is nonzero, all outgoing packets to
the remote server will have an authentication
field attached encrypted with this key. If the
value is 0 (or not given) no authentication
will be done. If ntpdc's key number has not
yet been set (\fIe.g.,\fP by the keyid
command), it will be set to this value.
The \fBversion#\fP can be 1 through 4 and defaults to 3.  The remaining
options are either a numeric value for \fIminpoll#\fP or
literals \fBprefer\fP, \fBiburst\fP, 
\fBburst\fP, \fBminpoll  \fP\fIN\fP,
\fBkeyid \fP\fIN\fP, \fBversion \fP \fIN\fP, or
\fBmaxpoll  \fP\fIN\fP (where \fIN\fP is a numeric value), and have the action as specified in the
\fBpeer\fP configuration file command of
ntpd.  See the  server options page  at file:///usr/share/doc/ntp/confopt.html for further information.
Each flag (or its absence) replaces the
previous setting. The \fBprefer\fP keyword indicates a preferred peer (and thus will be used primarily for clock synchronisation if possible). The preferred peer also determines the validity of the PPS signal - if the preferred peer is suitable for synchronisation so is the PPS signal.
The \fBdynamic\fP keyword allows association configuration even when no suitable network interface is found at configuration time. The dynamic interface update mechanism may complete the configuration when new interfaces appear (e.g. WLAN/PPP interfaces) at a later time and thus render the association operable.
.TP
.BR "addserver \fIpeer_address\fP [ \fIkeyid\fP ] [ \fIversion\fP ] [\fIminpoll#\fP"
.BR "| prefer | iburst  | burst | minpoll \fIN\fP | maxpoll \fIN\fP [...] ]"
.TP
.BR "addserver \fIpeer_address\fP [ \fBprefer | iburst | burst | minpoll \fIN\fP"
.BR "| maxpoll \fIN\fP | keyid \fIN\fP | version \fIN\fP [...] [ dynamic ] ]"
.sp
Identical to the addpeer command, except that the operating mode is client.
.TP
.BR "addrefclock \fIclock_address\fP [  \fImode\fP [ \fBprefer | burst | minpoll \fIN\fP"
.BR "| \fBmaxpoll\fP \fIN\fP  ...]]"
.sp
Identical to the addpeer command, except that the address is a REFCLOCK designator and it configures a hardware refclock
instead of a remote server.
.TP
.BR "broadcast \fIpeer_address\fP [ \fIkeyid\fP ] [ \fIversion\fP ] [ prefer ]"
Identical to the addpeer command, except
that the operating mode is broadcast. In this
case a valid non-zero key identifier and key are required. The \fBpeer_address\fP parameter can be the broadcast address of the local network or a multicast group address assigned to NTP. If a multicast address, a multicast-capable kernel is required.
.TP
.BR "unconfig \fIpeer_address\fP [...]"
This command causes the configured bit to be removed from the specified peer(s). In many cases this will cause the peer association to be deleted. When appropriate, however, the association may persist in an unconfigured mode if the remote peer is willing to continue on in this fashion.
.TP
.BR "fudge \fIpeer_address\fP [ \fItime1\fP ] [ \fItime2\fP ] [ \fIstratum\fP ] [ \fIrefid\fP ]"
This command provides a way to set certain data for a reference clock. See the source listing for further information.
.TP
.BR "enable [ auth | bclient | calibrate | kernel | monitor | ntp | pps | stats]"
.TP
.BR "disable [ auth | bclient | calibrate | kernel | monitor | ntp | pps | stats]"
These commands operate in the same way as the \fBenable\fP and \fBdisable\fP configuration file commands of \fBntpd\fP. See the <a href="miscopt.html">Miscellaneous Options</a> page for further information.
.TP
.BR "restrict \fIaddress mask flag\fP [ \fIflag\fP ]"
This command operates in the same way as the \fBrestrict\fP configuration file commands of \fBntpd\fP.
.TP
.BR "unrestrict \fIaddress mask flag\fP [ \fIflag\fP ]"
Unrestrict the matching entry from the restrict list.
.TP
.BR "delrestrict \fIaddress mask [ ntpport ]\fP"
Delete the matching entry from the restrict list.
.TP
.BR "readkeys"
Causes the current set of authentication keys to be purged and a new set to be obtained by rereading the keys file (which must have been specified in the \fBntpd\fP configuration file). This allows encryption keys to be changed without restarting the server.
.TP
.BR "trustedkey \fIkeyid\fP [...]"
.TP
.BR "untrustedkey \fIkeyid\fP [...]"
.TP
.BR "controlkey \fIkeyid\fP [...]"
.TP
.BR "requestkey \fIkeyid\fP [...]"
These commands operate in the same way as the corresponding configuration file commands of \fBntpd\fP.
.TP
.BR "keytype md5"
This command specifies the default keytype. Since the only type currently support is md5, this is a nop.
.TP
.BR "authinfo"
Returns information concerning the authentication module, including known keys and counts of encryptions and decryptions which have been done.
.TP
.BR "traps"
Display the traps set in the server. See the source listing for further information.
.TP
.BR "addtrap [ \fIaddress\fP [ \fIport\fP ] [ \fIinterface\fP ]"
Set a trap for asynchronous messages. See the source listing for further information.
.TP
.BR "clrtrap [ \fIaddress\fP [ \fIport\fP ] [ \fIinterface\fP]"
Clear a trap for asynchronous messages. See the source listing for further information.
.TP
.BR "reset"
Clear the statistics counters in various modules of the server. See the source listing for further information.
.TP
.BR "preset [\fIpeer_address\fP [...]]"
Clear the statistics counters in various modules of the server with respect to the indicated peers.
.SS OPTION PRESETS
Most options may be preset by loading values from configuration file(s) and values from
environment variables named:
.nf
  \fBNTPDC_<option-name>\fP or \fBNTPDC\fP
.fi
.aj
The environmental presets take precedence (are processed later than)
the configuration files. The option-name should be in all capital letters.
For example, to set the --command option, you would set the NTPDC_COMMAND environment
variable.
The users home directory and the current directory are searched for a file named .ntprc.
.PP
.SH SEE ALSO
.LP
\fBntpd\fR(1M), \fBntpq\fR(1M), \fBntprc\fR(4), \fBattributes\fR(5)

