Repository: OpenIndiana/oi-userland
Catalog: components/gnome-netstatus/files/po-sun/*.po
Languages: de, it, ko

source: You have selected to manually configure the network..
de: Sie haben sich dafür entschieden, das Netzwerk manuell zu konfigurieren.
it: È stata selezionata la configurazione manuale della rete.
ko: 네트워크를 수동으로 구성하도록 선택했습니다.

source: IP Address (v4)
de: IP-Adresse (v4)
it: Indirizzo IP (v4)
ko: IP 주소(v4)

source: Wireless Network
de: Kabelloses Netzwerk
it: Rete wireless
ko: 무선 네트워크

source: <b>Wireless</b>
de: <b>Drahtlos</b>
ko: <b>무선</b>

source: Access Point (BSSID):
de: Zugriffspunkt (BSSID):
it: Punto di accesso (BSSID):
ko: 액세스 포인트(BSSID):

source: Authentication Mode:
de: Authentifizierungsmodus:
it: Modalità di autenticazione:
ko: 인증 모드:

source: Configure network _automatically
de: Netzwerk _automatisch konfigurieren
it: Configura _automaticamente la rete
ko: 자동으로 네트워크 구성(_A)

source: Network Name (ESSID):
de: Netzwerkname (ESSID):
it: Nome rete (ESSID):
ko: 네트워크 이름(ESSID):

source: Operational Mode (BSS):
de: Betriebsmodus (BSS):
it: Modalità di funzionamento (BSS):
ko: 작동 모드(BSS):

source: Restart
de: Neustart
it: Riavvia
ko: 다시 시작

source: Security:
de: Sicherheit:
it: Protezione:
ko: 보안:

source: Signal Strength:
de: Signalstärke:
it: Potenza segnale:
ko: 신호 감도:

source: You may need to restart the connection if you want to connect to a different network, or if you are experiencing connection problems.
de: Wenn Sie eine Verbindung mit einem anderen Netzwerk herstellen möchten oder keine Erfahrung mit Verbindungsproblemen haben, muss die Verbindung eventuell neu gestartet werden.
it: Potrebbe essere necessario riavviare la connessione per connettersi a un'altra rete o se si riscontrano problemi di connessione.
ko: 다른 네트워크에 연결하려고 하거나 연결에 문제가 있는 경우 연결을 다시 시작해야 할 수 있습니다.

source: _Restart
de: _Neustart
it: _Riavvia
ko: 다시 시작(_R)

source: _Track system active interface
de: Aktive Systemschnittstelle _verfolgen
it: _Rileva interfaccia di sistema attiva
ko: 시스템 활성 인터페이스 추적(_T)

source: You have selected that the network be automatically configured.
de: Sie haben sich dafür entschieden, das Netzwerk automatisch zu konfigurieren.
it: È stata selezionata la configurazione automatica della rete.
ko: 네트워크를 자동으로 구성하도록 선택했습니다.

source: This will cause your network to be restarted Do you wish to continue?
de: Durch diesen Vorgang wird das Netzwerk neu gestartet Möchten Sie fortfahren?
it: Ciò comporterà il riavvio della rete Continuare?
ko: 이렇게 하면 네트워크가 다시 시작됩니다. 계속하시겠습니까?

source: Signal Strength
de: Signalstärke
it: Potenza segnale
ko: 신호 감도

source: Operational Mode
de: Betriebsmodus
it: Modalità di funzionamento
ko: 작동 모드

source: Track Active Interface
de: Aktive Schnittstelle verfolgen
it: Rileva interfaccia attiva
ko: 활성 인터페이스 추적

source: Whether to track the system's active interface
de: Verfolgung der aktiven Schnittstelle des Systems
it: Se rilevare l'interfaccia di sistema attiva
ko: 시스템의 활성 인터페이스를 추적할지 여부

source: Wireless ESSID
de: Drahtlos-ESSID
it: ESSID wireless
ko: 무선 ESSID

source: Wireless BSSID
de: Drahtlos-BSSID
it: BSSID wireless
ko: 무선 BSSID

source: BSS_MODE
de: BSS_MODUS
it: Modalità_BSS

source: Wireless BSS_Mode
de: Drahtloser BSS_Modus
it: Modalità_BSS wireless
ko: 무선 BSS_Mode

source: Wireless CONNECTED
de: Drahtlos VERBUNDEN
it: CONNESSIONE wireless
ko: 무선 연결됨

source: Whether the interface is connected
de: Verbindung der Schnittstelle
it: Se l'interfaccia è connessa
ko: 인터페이스가 연결되어 있는지 여부

source: MODE
de: MODUS
it: MODALITÀ
ko: 모드

source: Wireless MODE
de: Drahtlos-MODUS
it: MODALITÀ wireless
ko: 무선 모드

source: SECURITY
de: SICHERHEIT
it: PROTEZIONE
ko: 보안

source: Wireless SECURITY
de: Drahtlos-SICHERHEIT
it: PROTEZIONE wireless
ko: 무선 보안

source: AUTH_MODE
de: AUTH_MODUS
it: MODALITÀ_AUTENTICAZIONE

source: Wireless AUTH_MODE
de: Drahtloser AUTH_MODUS
it: MODALITÀ_AUTENTICAZIONE wireless
ko: 무선 AUTH_MODE

source: Infrastructure
de: Infrastruktur
it: Infrastruttura
ko: 인프라

source: Computer-to-Computer (Ad Hoc)
de: Computer-zu-Computer (Ad Hoc)
it: Da computer a computer (specifica)
ko: 컴퓨터 대 컴퓨터(임시)

source: Any
de: Beliebig
it: Qualsiasi
ko: 임의

source: None
de: Ohne
it: Nessuna
ko: 없음

source: Open
de: Offen
it: Aperta
ko: 열기

source: Shared
de: Gemeinsam
it: Condivisa
ko: 공유
