OpenIndiana/oi-userland/components/library/idnkit/man/idnkit.pc.5
'\" te
.\" Copyright (c) 2004, 2017, Oracle and/or its affiliates. All rights reserved.
.TH idnkit.pc 5 "11 Jun 2017" "Solaris 11.4" "File Formats"
.SH NAME
idnkit.pc \- meta information data file for libidnkit
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/pkgconfig/idnkit.pc\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBidnkit.pc\fR is the meta information data file for \fBlibidnkit\fR(3). Use \fBpkg-config(1)\fR to retrieve the defined values such as compile and link flags for the library.
.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBidnkit.pc\fR through \fBpkg-config\fR
.sp
.LP
The following command yields compile and link flags, if any, for \fBlibidnkit\fR(3): 

.sp
.in +2
.nf
example% pkg-config --cflags --libs idnkit 
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
\fBidn_checkname\fR(3), \fBidn_comparenames\fR(3), \fBidn_decodename\fR(3), \fBidn_encodename\fR(3), \fBidn_nameinit\fR(3), \fBidn_result_tostring\fR(3), \fBidn_setlanguage\fR(3), \fBidn_setlocalencoding\fR(3), \fBidn_setlocalcheckfile\fR(3), \fBidn_version_getstring\fR(3), \fBidn_version_idnatable\fR(3), \fBidn_version_libidn\fR(3), \fBidn_version_unicode\fR(3), \fBattributes\fR(7)
