Repository: OpenIndiana/oi-userland
Catalog: components/desktop/gnome2/gnome-control-center/files/po-sun/*.po
Languages: ar, ca, cs, hu, id

source: <b>C_ustom:</b> Uses custom set of effects.
ar: <b>تعديل:</b> يستخدم تعديل دائم من التأثيرات.
ca: <b>_Personalitzat:</b> Utilitza un conjunt d'efectes personalitzat.
cs: <b>V_lastní:</b> použije vlastní sadu efektů.
hu: <b>Egyedi:</b> Egyedi effekt beállítások használata.
id: <b>C_ustom:</b> Gunakan custom untuk tata efek

source: <b>E_xtra:</b> Provides more aesthetically pleasing set of effects. Requires faster graphics-card.
ar: <b>زيادة_:</b> يوفر مجموعة من التحسينات الجمالية لمجموعة من التأثيرات. والتي تتطلب كرت شاشة أقوى
ca: <b>E_xtra:</b> Proporciona un conjunt d'efectes més agradables estèticament. Necessita una targeta gràfica més ràpida.
cs: <b>E_xtra:</b> poskytne sadu více esteticky příjemných efektů. Požaduje rychlejšígrafickou kartu.
hu: <b>E_xtra:</b> Több esztétikailag tetszetős effektusokat nyújt. Gyorsabb grafikus kártyát igényel.
id: <b>E_xtra:</b> Menyediakan banyak efek tata estetis yang menyenangkan. Membutuhkan kartu-grafik yang cepat.

source: <b>N_ormal:</b> Provides improved usability and good balance between attractiveness and moderate performance-requirements.
ar: <b>طبيعي_:</b> يوفر الإستخدامات المحسنة والتوازن الجيد بين جاذبية ومتطلبات الأداء المعتدل .
ca: <b>N_ormal:</b> Proporciona una usabilitat millorada i un bon balanç entre l'estètica i les necessitats moderades de rendiment.
cs: <b>N_ormální:</b> poskytne vylepšenou použitelnost a vyváženost mezi atraktivitoua středními požadavky na výkon.
hu: <b>N_ormál:</b> Megnövekedett felhasználhatóságot és jó egyensúlyt nyújt látványosság és mérsékelt teljesítmény szükségletet között.
id: <b>N_ormal:</b> Menyediakan perbaikan penggunaan dan keseimbangan yang baik antara kecantikan dan moderasi kebutuhan performansi

source: <b>_None:</b> Provides a simple desktop environment without any effects.
ar: <b>_بلا:</b> يوفر بيئة سطح مكتب بسيط بدون أي تأثيرات.
ca: <b>_Sense:</b> Proporciona un entorn d'escriptori senzill sense cap efecte.
cs: <b>_Žádné</b> poskytne jednoduché prostředí plochy bez efektů.
hu: <b>_Nincs:</b> Egyszerű asztali környezet effektusok nélkül.
id: <b>_None:</b> Menyediakan lingkungan desktop sederhana tanpa efek.

source: Visual Effects
ar: التأثيرات المرئية
ca: Efectes visuals
cs: Vizuální efekty
hu: Vizuális effektusok
id: Visual Efek

source: Testing the new settings. If you don't respond in %d second the previous settings will be restored.
ar: تجربة الإعدادات الجديدة. إذا لم تستجب خلال %d ثانية الأعدادات السابقة سوف تعود
ca: Al provar les noves preferències. Si no responeu en %d segons, es restabliran les preferències anteriors.
cs: Testuji nové nastavení. Pokud nezareagujete do %d vteřiny, bude obnoveno původní nastavení.
hu: Új beállítások tesztelése. Ha nem válaszol %d másodpercen belül, akkor a korábbi beállítások kerülnek visszaállításra.
id: Mengetes penataan baru. Jika anda tidak mendapatkan respon di %d penataan sebelumnya akan di kembalikan

source: Keep Settings
ar: الإحتفاظ بالأعدادات
ca: Mantenir preferències
cs: Zachovat nastavení
hu: Beállítások megtartása
id: Simpan Penataan

source: Do you want to keep these settings?
ar: هل تريد الإحتفاظ بهذه الإعدادات
ca: Voleu mantenir les vostres preferències?
cs: Přejete si zachovat toto nastavení?
hu: Meg kívánja tartani ezeket a beállításokat?
id: Apakah anda ingin menyimpan penataan ini?

source: Use _previous settings
ar: إستعمل _الإعدادات السابقة
ca: Utilitzat _preferències anteriors
cs: Použít _předchozí nastavení
hu: _Előző beállítások használata
id: Gunakan penataan _sebelumnya

source: _Keep settings
ar: _الإحتفاظ بالإعدادات
ca: Mantenir preferències
cs: _Zachovat nastavení
hu: _Beállítások megtartása
id: _Menyimpan Penataan

source: Desktop effects could not be enabled
ar: تأثيرات سطح المكتب لايمكن تفعيلها
ca: No es poden habilitar els efectes d'escriptori
cs: Efekty plochy nemohou být povoleny
hu: Effektusok engedélyezése meghiúsult
id: Efek desktop tidak bisa di aktifkan

source: <b>Visual effects cannot be enabled</b> Details :
ar: <b>التأثيرات المرئيةلايمكن تفعيلها</b> تفاصيل :
ca: <b>No es poden habilitar els efectes visuals</b> Detalls :
cs: <b>Vizuální efekty nemohou být povoleny</b> Podrobnosti :
hu: <b>Vizuális effektusokat nem lehetett bekapcsolni</b> Részletek :
id: <b>Visual efek tidak bisa di aktifkan</b> Detil :

source: Composite extension is not enabled
ar: إمتداد المركبات لا يمكن تفعيلها
ca: L'extensió Composite no està habilitada
cs: Kompozitní rozšíření není povoleno
hu: Composite kiterjesztés nincs bekapcsolva
id: Komposisi extensi di bisa di aktifkan

source: This application was compiled without the OpenGL extension
ar: هذا التطبيق قد تم بناءه بدون OpenGL extension
ca: Aquesta aplicació va ser compilada sense l'extensió OpenGL
cs: Tato aplikace byla zkompilována bez OpenGL rozšíření
hu: Ez az alkalmazás OpenGL kiterjesztés nélkül lett lefordítva
id: Aplikasi ini telah di compile tanpa extensi OpenGL

source: The OpenGL extension TextureFromPixmap is not enabled
ar: The OpenGL extension TextureFromPixmap غير فعالة
ca: L'extensió TextureFromPixmap d'OpenGL no està habilitada
cs: OpenGL rozšíření TextureFromPixmap není povoleno
hu: TextureFromPixmap OpenGL kiterjesztés nincs bekapcsolva
id: Extensi TextureFronPixmap OpenGL tidak bisa di aktifkan

source: Compiz is not installed on the system
ar: Compiz غير منصب ضمن النظام
ca: Compiz no està instal·lat al sistema
cs: Compiz není nainstalován na Vašem systému
hu: Compiz nincs telepítve a rendszeren
id: Compiz tidak bisa di install pada sistem

source: Check if visual effects can be enabled
ar: تحقق إذا التأثيرات المرئية يمكن تفعيلها
ca: Comprovar si es poden habilitar els efectes visuals
cs: Zkontrolujte, zda mohou být vizuální efekty povoleny
hu: Jelölje ki a vizuális effektek engedélyezéséhez
id: Periksa jika visual efek dapat di aktifkan

source: Choose applications to open different types of documents
ar: إختر تطبيقات لكي تفتح مستندات من أنواع مختلفة
ca: Triar les aplicacions per obrir diferents tipus de documents
cs: Zvolte aplikaci pro otevření různých typů dokumentů
hu: Rendeljen alkalmazásokat különböző típusú dokumentumok megnyitásához.
id: Pilih aplikasi untuk membuka tipe dokumen yang berbeda

source: Adjust the screen resolution and rotation
ar: ضبط دقة الشاشة والتناوب
ca: Ajustar la resolució i rotació de la pantalla
cs: Nastavit rozlišení a rotaci obrazovky
hu: Képernyő felbontás és forgatás beállítása
id: Menyesuaikan resolusi layar dan rotasi

source: Set auto-repeat preferences and enforce typing breaks
ar: تعين تكرار التفضيلات وتطبيق الفواصل
ca: Establir l'auto-repetició i forçar les pauses entre tecles
cs: Nastavit předvolby automatického opakování a vynutit přestávky při psaní
hu: Automatikus ismétlés tulajdonságainak és gépelési szünetek kikényszerítésének beállításai
id: Tata pilihan auto-ulang dan memaksa pengetikan berhenti

source: Set mouse button and motion preferences
ar: تعين زر الفأرة وفضيلات الحركة
ca: Establir el botó i desplaçament del ratolí
cs: Nastavit tlačítko myši a její vlastnosti
hu: Egér gomb és mozgás tulajdonságainak beállítása
id: Tata tombol mouse dan pilihan gerakan

source: Set up a network proxy for most desktop applications
ar: تعين و وكيل الشبكة من أجل معظم تطبيقات سطح المكتب
ca: Configurar el proxy de xarxa per quasi bé totes les aplicacions de l'escriptori
cs: Nastavit síťovou proxy pro většinu desktopových aplikací
hu: Hálózati proxy beállítása a legtöbb alkalmazás számára
id: Tata proxy jaringan untuk aplikasi desktop

source: Change window selection, movement and sizing behavior
ar: تغير أختيار النافذة, تنقل وطبيعة تغير الحجم
ca: Canviar el comportament de la selecció de la finestra, moviment i re-dimensió
cs: Změnit vlastnosti výběru okna, pohybu a změny velikosti
hu: Ablak kiválasztás, mozgatás és méretezési viselkedés megváltoztatása
id: Ubah jendela yang di seleksi, gerakan dan perilaku ukuran
