OpenIndiana/oi-userland/components/bind/Solaris/dnssec-signkey.8
'\" te
.\" Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")  Copyright (C) 2000, 2001, 2003  Internet Software Consortium.   Permission to use, copy, modify, and distribute this software for any  purpose with or without fee is hereby granted, provided that the above  copyright notice and this permission notice appear in all copies.   THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH  REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY  AND FITNESS.  IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,  INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM  LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE  OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR  PERFORMANCE OF THIS SOFTWARE.
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH dnssec-signkey 8 "19 Oct 2015" "SunOS 5.12" "System Administration Commands"
.SH NAME
dnssec-signkey \- DNSSEC key set signing tool
.SH SYNOPSIS
.LP
.nf
\fBdnssec-signkey\fR [\fB-ahp\fR] [\fB-c\fR \fIclass\fR] [\fB-e\fR \fIend-time\fR] 
     [\fB-r\fR \fIrandomdev\fR] [\fB-s\fR \fIstart-time\fR] [\fB-v\fR \fIlevel\fR] \fIkeyset\fR \fIkey\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdnssec-signkey\fR utility signs a keyset. Typically the keyset will be for a child zone and will have been generated by \fBdnssec-makekeyset\fR(8). The child zone's keyset is signed with the zone keys for its parent zone. The output file is of the form \fBsignedkey\fR-\fInnnn.\fR, where \fInnnn\fR is the zone name.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-a\fR\fR
.ad
.RS 17n
.rt  
Verify all generated signatures.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIclass\fR\fR
.ad
.RS 17n
.rt  
Specify the DNS class of the key sets.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-e\fR \fIend-time\fR\fR
.ad
.RS 17n
.rt  
Specify the date and time when the generated SIG records expire. As with \fIstart-time\fR, an absolute time is indicated in \fBYYYYMMDDHHMMSS\fR notation. A time relative to the start time is indicated with +\fIN\fR, which is \fIN\fR seconds from the start time. A time relative to the current time is indicated with now+\fIN\fR. If no \fIend-time\fR is specified, 30 days from the start time is used as a default.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-h\fR\fR
.ad
.RS 17n
.rt  
Prints a short summary of the options and arguments to \fBdnssec-signkey()\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR\fR
.ad
.RS 17n
.rt  
Use pseudo-random data when signing the zone. This is faster, but less secure, than using real random data. This option may be useful when signing large zones or when the entropy source is limited.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fIrandomdev\fR\fR
.ad
.RS 17n
.rt  
Specify the source of randomness. If the operating system does not provide a \fB/dev/random\fR or equivalent device, the default source of randomness is keyboard input. \fIrandomdev\fR specifies the name of a character device or file containing random data to be used instead of the default. The special value \fBkeyboard\fR indicates that keyboard input should be used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR \fIstart-time\fR\fR
.ad
.RS 17n
.rt  
Specify the date and time when the generated SIG records become valid. This can be either an absolute or relative time. An absolute start time is indicated by a number in \fBYYYYMMDDHHMMSS\fR notation; 20000530144500 denotes 14:45:00 UTC on May 30th, 2000. A relative start time is indicated by +\fIN\fR, which is \fIN\fR seconds from the current time. If no \fIstart-time\fR is specified, the current time is used.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR \fIlevel\fR\fR
.ad
.RS 17n
.rt  
Set the debugging level.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIkey\fR\fR
.ad
.RS 10n
.rt  
The keys used to sign the child's keyset.
.RE

.sp
.ne 2
.mk
.na
\fB\fIkeyset\fR\fR
.ad
.RS 10n
.rt  
The file containing the child's keyset.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSign the \fIkeyset\fR file for \fBexample.com\fR.
.sp
.LP
The DNS administrator for a DNSSEC-aware \fB\&.com\fR zone would use the following command to sign the \fIkeyset\fR file for \fBexample.com\fR created by \fBdnssec-makekeyset\fR with a key generated by \fBdnssec-keygen\fR:

.sp
.in +2
.nf
dnssec-signkey keyset-example.com. Kcom.+003+51944
.fi
.in -2
.sp

.sp
.LP
In this example, \fBdnssec-signkey\fR creates the file \fBsignedkey-example.com\fR, which contains the \fBexample.com\fR keys and the signatures by the \fB\&.com\fR keys.

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) cw(2.75i) 
lw(2.75i) lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
AvailabilitySUNWbind9
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBdnssec-keygen\fR(8), \fBdnssec-makekeyset\fR(8), \fBdnssec-signzone\fR(8), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
Source for BIND9 is available in the SUNWbind9S package.
