OpenIndiana/oi-userland/components/bind/Solaris/named.8
'\" te
.\" Copyright (C) 2010 Internet Systems Consortium, Inc. ("ISC")
.\" Permission to use, copy, modify, and/or distribute this software for any purpose  with or without fee is hereby granted, provided that the above copyright notice  and this permission notice appear in all copies.  THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL,  DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING  FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE  USE OR PERFORMANCE OF THIS SOFTWARE.
.\" Portions Copyright (c) 2010, Sun Microsystems, Inc. All Rights Reserved.
.TH named 8 "19 Oct 2015" "SunOS 5.12" "System Administration Commands"
.SH NAME
named, in.named \- Internet domain name server
.SH SYNOPSIS
.LP
.nf
\fBnamed\fR [\fB-fgsVv\fR] [\fB-c\fR \fIconfig-file\fR] [\fB-d\fR \fIdebug-level\fR] [\fB-m\fR \fIflag\fR]
     [\fB-n\fR \fI#cpus\fR] [\fB-p\fR \fIport\fR] [\fB-S\fR \fI#max-socks\fR] [\fB-t\fR \fIdirectory\fR]
     [\fB-u\fR \fIuser\fR] [\fB-x\fR \fIcache-file\fR] [\fB-4\fR | \fB-6\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnamed\fR utility is a Domain Name System (DNS) server, part of the BIND 9 distribution from ISC. For more information on the DNS, see RFCs 1033, 1034, and 1035.
.sp
.LP
When invoked without arguments, \fBnamed\fR reads the default configuration file \fB/etc/named.conf\fR, reads any initial data, and listens for queries.
.sp
.LP
\fBin.named\fR is a link to \fBnamed\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-4\fR\fR
.ad
.sp .6
.RS 4n
Use only IPv4 transport. By default, both IPv4 and IPv6 transports can be used. Options \fB-4\fR and \fB-6\fR are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-6\fR\fR
.ad
.sp .6
.RS 4n
Use only IPv6 transport. By default, both IPv4 and IPv6 transports can be used. Options \fB-4\fR and \fB-6\fR are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR \fIconfig-file\fR\fR
.ad
.sp .6
.RS 4n
Use \fIconfig-file\fR as the configuration file instead of the default \fB/etc/named.conf\fR. To ensure that reloading the configuration file continues to work after the server has changed its working directory due to to a possible \fIdirectory\fR option in the configuration file, \fIconfig-file\fR should be an absolute pathname.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-d\fR \fIdebug-level\fR\fR
.ad
.sp .6
.RS 4n
Set the daemon's debug level to \fIdebug-level\fR. Debugging traces from \fBnamed\fR become more verbose as the debug level increases.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-f\fR\fR
.ad
.sp .6
.RS 4n
Run the server in the foreground (that is, do not run as a daemon).
.RE

.sp
.ne 2
.mk
.na
\fB\fB-g\fR\fR
.ad
.sp .6
.RS 4n
Run the server in the foreground and force all logging to \fBstderr\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-m\fR \fIflag\fR\fR
.ad
.sp .6
.RS 4n
Turn on memory usage debugging flags. Possible flags are \fBusage\fR, \fBtrace\fR, and \fBrecord\fR, \fBsize\fR, and \fBmctx\fR. These correspond to the \fBISC_MEM_DEBUG\fR\fIXXXX\fR flags described in \fB<isc/mem.h>\fR\&.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-n\fR \fI#cpus\fR\fR
.ad
.sp .6
.RS 4n
Create \fI#cpus\fR worker threads to take advantage of multiple CPUs. If not specified, \fBnamed\fR will try to determine the number of CPUs present and create one thread per CPU. If it is unable to determine the number of CPUs, a single worker thread will be created.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-p\fR \fIport\fR\fR
.ad
.sp .6
.RS 4n
Listen for queries on port \fIport\fR. If not specified, the default is port 53.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-S\fR \fI#max-socks\fR\fR
.ad
.sp .6
.RS 4n
Allow \fBnamed\fR to use up to \fI#max-socks\fR sockets.
.sp
This option should be unnecessary for the vast majority of users. The use of this option could even be harmful, because the specified value might exceed the limitation of the underlying system API. It therefore should be set only when the default configuration causes exhaustion of file descriptors and the operational environment is known to support the specified number of sockets. Note also that the actual maximum number is normally a little smaller than the specified value because \fBnamed\fR reserves some file descriptors for its internal use.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-s\fR\fR
.ad
.sp .6
.RS 4n
Write memory usage statistics to \fIstdout\fR on exit. 
.sp
This option is mainly of interest to BIND 9 developers and might be removed or changed in a future release.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-t\fR \fIdirectory\fR\fR
.ad
.sp .6
.RS 4n
Change the root directory using \fBchroot\fR(2) to \fIdirectory\fR after processing the command line arguments, but before reading the configuration file. 
.sp
This option should be used in conjunction with the \fB-u\fR option, as chrooting a process running as root does not enhance security on most systems; the way \fBchroot()\fR is defined allows a process with root privileges to escape a \fBchroot\fR jail.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-u\fR \fIuser\fR\fR
.ad
.sp .6
.RS 4n
Set the real user ID using \fBsetuid\fR(2) to \fIuser\fR after completing privileged operations, such as creating sockets that listen on privileged ports.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-V\fR\fR
.ad
.sp .6
.RS 4n
Report the version number and build options, and exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-v\fR\fR
.ad
.sp .6
.RS 4n
Report the version number and exit.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR \fIcache-file\fR\fR
.ad
.sp .6
.RS 4n
Load data from \fIcache-file\fR into the cache of the default view.
.sp
Do not use this option. It is of interest only to BIND 9 developers and might be removed or changed in a future release.
.RE

.SH EXTENDED DESCRIPTION
.sp
.LP
This section describes additional attributes of \fBnamed\fR.
.SS "SMF Properties"
.sp
.LP
When starting named from the service management facility, \fBsmf\fR(7), \fBnamed\fR configuration is read from the service configuration repository. Use \fBsvcprop\fR(1) to list the properties and \fBsvccfg\fR(8) to make changes.
.sp
.LP
The following application configuration properties are available to administrators:
.sp
.ne 2
.mk
.na
\fB\fBoptions\fR/\fIserver\fR\fR
.ad
.sp .6
.RS 4n
Specifies the server executable to be used instead of the default server, \fB/usr/sbin/named\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptions\fR/\fIconfiguration_file\fR\fR
.ad
.sp .6
.RS 4n
Specifies the configuration file to be used instead of the default, \fB/etc/named.conf\fR. A directory option might be specified in the configuration file. To ensure that reloading the configuration file continues to work in such a situation, \fIconfiguration_file\fR should be specified as an absolute pathname. This pathname should not include the \fIchroot_dir\fR pathname. This property is the equivalent of the \fB-c\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptions\fR/\fIip_interfaces\fR\fR
.ad
.sp .6
.RS 4n
Specifies over which IP transport, IPv4 or IPv6, BIND will transmit. Possible values are \fBIPv4\fR or \fBIPv6\fR. Any other setting assumes \fBall\fR, the default. This property is the equivalent of command line option \fB-4\fR or \fB-6\fR
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptions\fR/\fIlisten_on_port\fR\fR
.ad
.sp .6
.RS 4n
Specifies the default UDP and TCP port to be used for listening to DNS requests. This property is the equivalent of the command line option \fB-p\fR \fIport\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptions\fR/\fIdebug_level\fR\fR
.ad
.sp .6
.RS 4n
Specifies the default debug level. The default is 0, which means no debugging. The higher the number the more verbose debug information becomes. Equivalent of the command line option \fB-d\fR \fIdebug_level\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptions\fR/\fIthreads\fR\fR
.ad
.sp .6
.RS 4n
Specifies the number of CPU worker threads to create. The default of 0 causes \fBnamed\fR to try and determine the number of CPUs present and create one thread per CPU. Equivalent of command line option \fB-n\fR \fI#cpus\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fBoptions\fR/\fIchroot_dir\fR\fR
.ad
.sp .6
.RS 4n
Specifies the directory to be used as the root directory after processing SMF properties and the command line arguments but before reading the configuration file. Use this property when using a \fBchroot\fR(2) environment. Synonymous to command line option \fB-t\fR \fIpathname\fR.
.sp
When using \fBchroot\fR(2), \fBnamed\fR is unable to disable itself when receiving \fBrndc\fR(8) \fBstop\fR or \fBhalt\fR commands. Instead, you must use the \fBsvcadm\fR(8) \fBdisable\fR command.
.RE

.sp
.LP
In the event of a configuration error originating in one of the above SMF application options, \fBnamed\fR displays a message providing information about the error and the parameters that need correcting. The process then exits with exit code \fBSMF_EXIT_ERR_CONFIG\fR.
.sp
.LP
At startup, in the event of an error other than a configuration error, \fBnamed\fR exits with exit code \fBSMF_EXIT_ERR_FATAL\fR. Both of this code and \fBSMF_EXIT_ERR_CONFIG\fR cause the start method, \fBsmf_method\fR(7), to place the service in the maintenance state, which can be observed with the \fBsvcs\fR(1) command \fBsvcs\fR \fB-x\fR.
.sp
.LP
In addition to the properties listed above, the following property can be used to invoke \fBnamed\fR as a user other than root:
.sp
.ne 2
.mk
.na
\fB\fBstart\fR/\fIuser\fR\fR
.ad
.sp .6
.RS 4n
Specifies the identity of the user that is invoking \fBnamed\fR. See \fBsmf_method\fR(7) and \fBchroot\fR(2). Note that the user must have \fBsolaris.smf.manage.bind\fR authorization. Without this role the \fBnamed\fR will be unable to manage its SMF FMRI and \fBnamed\fR will automatically be restarted by the SMF after an \fBrndc\fR(8) \fBstop\fR or \fBhalt\fR command. See \fBEXAMPLES\fR for a sequence of commands that establishes the correct authorization.
.RE

.SS "SIGNALS"
.sp
.LP
In routine operation, signals should not be used to control the nameserver; \fBrndc\fR(8) should be used instead.
.sp
.ne 2
.mk
.na
\fB\fBSIGHUP\fR\fR
.ad
.sp .6
.RS 4n
Force a reload of the server.
.RE

.sp
.ne 2
.mk
.na
\fB\fBSIGINT\fR, \fBSIGTERM\fR\fR
.ad
.sp .6
.RS 4n
Shut down the server.
.RE

.sp
.LP
The result of sending any other signals to the server is undefined.
.SS "Configuration"
.sp
.LP
The \fBnamed\fR configuration file is too complex to describe in detail here. A list of configuration options is provided in the \fBnamed.conf\fR man page shipped with the BIND 9 distribution. A complete description is provided in the \fIBIND 9 Administrator Reference Manual\fR.
.SH EXAMPLES
.LP
\fBExample 1 \fRConfiguring \fBnamed\fR to Transmit Only over IPv4 Networks
.sp
.LP
The following command sequence configures \fBnamed\fR such that it will transmit only over IPv4 networks.

.sp
.in +2
.nf
# \fBsvccfg -s svc:network/dns/server:default setprop \e\fR
\fB> options/ip_interfaces=IPv4\fR
# \fBsvcadm refresh svc:network/dns/server:default\fR
#
.fi
.in -2
.sp

.LP
\fBExample 2 \fRListing Current Configuration File and Setting an Alternative File
.sp
.LP
The following sequence of commands lists the current \fBnamed\fR configuration file and sets an alternative file.

.sp
.in +2
.nf
# \fBsvcprop -p options/configuration_file dns/server:default\fR 
/etc/named.conf
# \fBsvccfg -s dns/server:default setprop \e
> options/configuration_file=/var/named/named.conf\fR
# \fBsvcadm refresh dns/server:default\fR
# \fBsvcprop -p options/configuration_file dns/server:default\fR
/var/named/named.conf
.fi
.in -2
.sp

.LP
\fBExample 3 \fREstablishing Appropriate Authorization for \fBnamed\fR
.sp
.LP
To have \fBnamed\fR start with the \fBsolaris.smf.manage.bind\fR authorization, perform the steps shown below.

.sp
.LP
Add the user \fBdnsadmin\fR to the \fBsolaris.smf.manage.bind\fR role:

.sp
.in +2
.nf
# \fBusermod -A solaris.smf.manage.bind dnsadmin\fR
\fBObserve effect of command:\fR
# \fBtail -1 /etc/user_attr\fR
dnsadmin::::type=normal;auths=solaris.smf.manage.bind
.fi
.in -2
.sp

.sp
.LP
Modify the service properties:

.sp
.in +2
.nf
# \fBsvccfg\fR
svc:> \fBselect svc:/network/dns/server:default\fR
svc:/network/dns/server:default> \fBsetprop start/user = dnsadmin\fR
svc:/network/dns/server:default> \fBsetprop start/group = dnsadmin\fR
svc:/network/dns/server:default> \fBexit\fR
# \fBsvcadm refresh svc:/network/dns/server:default\fR
# \fBsvcadm restart svc:/network/dns/server:default\fR
.fi
.in -2
.sp

.sp
.LP
Because only root has write access to create the default process-ID file,  \fB/var/run/named/named.pid\fR, \fBnamed\fR must be configured to use an alternative path for the user \fBdnsadmin\fR. Here is an example of how to accomplish this:

.sp
.in +2
.nf
# \fBmkdir /var/named/tmp\fR
# \fBchown dnsadmin /var/named/tmp\fR
.fi
.in -2
.sp

.sp
.LP
Shown below is what you must add to \fBnamed.conf\fR to make use of the directory created above.

.sp
.in +2
.nf
# \fBhead /etc/named.conf\fR
options {
directory "/var/named";
pid-file "/var/named/tmp/named.pid";
};
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/named.conf\fR\fR
.ad
.sp .6
.RS 4n
default configuration file
.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/run/named/named.pid\fR\fR
.ad
.sp .6
.RS 4n
default process-ID file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/dns/bind
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBnamed-checkconf\fR(8), \fBnamed-checkzone\fR(8), \fBrndc\fR(8), \fBrndc-confgen\fR(8), \fBsvcadm\fR(8), \fBsvccfg\fR(8), \fBsvcprop\fR(1), \fBchroot\fR(2), \fBsetuid\fR(2), \fBbind\fR(3C), \fBattributes\fR(7), \fBsmf\fR(7), \fBsmf_method\fR(7)
.sp
.LP
\fIRFC 1033\fR, \fIRFC 1034\fR, \fIRFC 1035\fR
.sp
.LP
See the BIND 9 \fIAdministrator's Reference Manual\fR. As of the date of publication of this man page, this document is available at https://www.isc.org/software/bind/documentation\&.
.sp
.LP
The \fBnamed.conf\fR man page shipped with the BIND 9 distribution
