OpenIndiana/oi-userland/components/bind/Solaris/rndc.conf.5
'\" te
.\" Copyright (C) 2009 Internet Systems Consortium, Inc. ("ISC")
.\" Permission to use, copy, modify, and/or distribute this software for any purpose with or without fee is hereby granted, provided that the above copyright notice and this permission notice appear in all copies.  THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.TH rndc.conf 5 "19 Oct 2015" "SunOS 5.12" "File Formats"
.SH NAME
rndc.conf \- rndc configuration file
.SH SYNOPSIS
.LP
.nf
rndc.conf
.fi

.SH DESCRIPTION
.sp
.LP
\fBrndc.conf\fR is the configuration file for \fBrndc\fR, the BIND 9 name server control utility. This file has a similar structure and syntax to \fBnamed.conf\fR. Statements are enclosed in braces and terminated with a semicolon. Clauses in the statements are also semicolon terminated. The usual comment styles are supported:
.sp
.ne 2
.mk
.na
\fBC style\fR
.ad
.RS 14n
.rt  
/* */
.RE

.sp
.ne 2
.mk
.na
\fBC++ style\fR
.ad
.RS 14n
.rt  
// to end of line
.RE

.sp
.ne 2
.mk
.na
\fBUnix style\fR
.ad
.RS 14n
.rt  
# to end of line
.RE

.sp
.LP
\fBrndc.conf\fR is much simpler than \fBnamed.conf\fR. The file uses three statements: an options statement, a server statement and a key statement.
.sp
.LP
The \fBoptions\fR statement contains five clauses. The \fBdefault-server\fR clause is followed by the name or address of a name server. This host is used when no name server is provided as an argument to \fBrndc\fR. The \fBdefault-key\fR clause is followed by the name of a key which is identified by a \fBkey\fR statement. If no \fBkeyid\fR is provided on the \fBrndc\fR command line, and no \fBkey\fR clause is found in a matching \fBserver\fR statement, this default key will be used to authenticate the server's commands and responses. The \fBdefault-port\fR clause is followed by the port to connect to on the remote name server. If no \fBport\fR option is provided on the \fBrndc\fR command line, and no \fBport\fR clause is found in a matching \fBserver\fR statement, this default port will be used to connect. The \fBdefault-source-address\fR and \fBdefault-source-address-v6\fR clauses which can be used to set the IPv4 and IPv6 source addresses respectively.
.sp
.LP
After the \fBserver\fR keyword, the server statement includes a string which is the hostname or address for a name server. The statement has three possible clauses: \fBkey\fR, \fBport\fR, and \fBaddresses\fR. The key name must match the name of a key statement in the file. The port number specifies the port to connect to. If an addresses clause is supplied these addresses will be used instead of the server name. Each address can take an optional port. If a \fBsource-address\fR or \fBsource-address-v6\fR is supplied then these will be used to specify the IPv4 and IPv6 source addresses respectively.
.sp
.LP
The \fBkey\fR statement begins with an identifying string, the name of the key. The statement has two clauses. \fBalgorithm\fR identifies the encryption algorithm for \fBrndc\fR to use; currently only HMAC-MD5 is supported. This is followed by a secret clause which contains the \fBbase-64\fR encoding of the algorithm's encryption key. The \fBbase-64\fR string is enclosed in double quotes.
.sp
.LP
There are two common ways to generate the \fBbase-64\fR string for the secret. The BIND 9 program \fBrndc-confgen\fR(8) can be used to generate a random key, or the \fBmmencode\fR program, also known as \fBmimencode\fR, can be used to generate a \fBbase-64\fR string from known input. \fBmmencode\fR does not ship with BIND 9 but is available on many systems. See the \fBEXAMPLES\fR section for sample command lines for each.
.SH EXAMPLES
.sp
.in +2
.nf
options {
   default-server  localhost;
   default-key     samplekey;
};

server localhost {
   key             samplekey;
};

server testserver {
   key         testkey;
   addresses   { localhost port 5353; };
};

key samplekey {
   algorithm  hmac-md5;
   secret     "6FMfj43Osz4lyb24OIe2iGEz9lf1llJO+lz";
};

key testkey {
   algorithm   hmac-md5;
   secret      "R3HI8P6BKw9ZwXwN3VZKuQ==";
}; 
.fi
.in -2
.sp

.sp
.LP
In the above example, \fBrndc\fR by default uses the server at \fBlocalhost\fR (127.0.0.1) and the key called \fBsamplekey\fR. Commands to the \fBlocalhost\fR server will use the \fBsamplekey\fR key, which must also be defined in the server's configuration file with the same name and secret. The key statement indicates that \fBsamplekey\fR uses the HMAC-MD5 algorithm and its secret clause contains the \fBbase-64\fR encoding of the HMAC-MD5 secret enclosed in double quotes.
.sp
.LP
If \fBrndc -s testserver\fR is used then \fBrndc\fR connects to server on \fBlocalhost\fR port 5353 using the key \fBtestkey\fR.
.sp
.LP
To generate a random secret with \fBrndc-confgen\fR:
.sp
.in +2
.nf
rndc-confgen
.fi
.in -2
.sp

.sp
.LP
A complete \fBrndc.conf\fR file, including the randomly generated key, will be written to the standard output. Commented out \fBkey\fR and \fBcontrols\fR statements for \fBnamed.conf\fR are also printed.
.sp
.LP
To generate a \fBbase-64\fR secret with \fBmmencode\fR:
.sp
.in +2
.nf
echo "known plaintext for a secret" | mmencode
.fi
.in -2
.sp

.SH NAME SERVER CONFIGURATION
.sp
.LP
The name server must be configured to accept \fBrndc\fR connections and to recognize the key specified in the \fBrndc.conf\fR file, using the controls statement in \fBnamed.conf\fR. See the sections on the \fBcontrols\fR statement in the \fIBIND 9 Administrator Reference Manual\fR for details.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/dns/bind
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBrndc\fR(8), \fBrndc-confgen\fR(8), \fBattributes\fR(5)
.sp
.LP
\fIBIND 9 Administrator Reference Manual\fR
