OpenIndiana/oi-userland/components/open-fabrics/infiniband-diags/manpages/set_nodedesc.sh.1m
'\" t
.\" Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
.\" Modified for Solaris to add the Solaris stability classification,
.\" and to add a note about source availability.
.\"
.TH SET_NODEDESC.SH 1M "4 April 2011" "USER COMMANDS"

.SH "NAME"
set_nodedesc.sh \- Set/View Node Description String for Infiniband Host Controller Adapters (HCA)s
.SH "SYNOPSIS"
.PP
\fBset_nodedesc.sh\fR
.sp
\fBset_nodedesc.sh\fR -N <\fBCommonString\fR>
.sp
\fBset_nodedesc.sh\fR -H <\fBHCAString\fR> -G \fBGUID\fR
.sp
\fBset_nodedesc.sh\fR -H <\fBHCAString\fR> -G \fBGUID\fR -N <\fBCommonString\fR>
.sp
\fBset_nodedesc.sh\fR -v
.sp
.SH "DESCRIPTION"
The \fBset_nodedesc.sh\fR utility can be used to set or view  Node description
strings for \fBInfiniBand(IB)\fR Host Controller \fBAdapters(HCA)\fR. The node
description string can consist of two parts :

	1. Node Description String common to all HCAs.
.br
	2. Node Description String specific to an HCA.
.sp
The complete Node Description string will be :
.sp
	<CommonNodeDescriptionString><HCANodeDescriptionString>
.sp
The common Node Description String is used if no HCA specific Node descr-
iption string is set. The Node Descriptor string from the HCA firmware
will be used if common node descriptor is not set.
.sp
\fBset_nodedesc.sh\fR called without arguments, sets the common node descriptor
string to the \fBhostname\fR(1M) of the system. The common Node descriptor string
can be set to a string other than the \fBhostname\fR(1M) using the -N option.
.sp
The HCA specific Node Description String can be set using the -H and -G
option. The Global Unique IDentifier (GUID) specified with -G identifies
the HCA to set the HCA specific Node Description string.  The options
-H and -G can be combined together with -N, to specify the common Node
description String.
.sp
The -v option can be used to view the Node descriptors for all HCAs on the
system.
.sp
.SH "EXAMPLES"
.TP
\fB1. Set Node descriptor string to hostname(1M) for all HCAs:\fR
.PP
	set_nodedesc.sh
.PP
.nf
\fB2. Set Node descriptor string to string "test":\fR
.PP
	#set_nodedesc.sh -N "test"
.PP
.nf
\fB3. Setting the HCA specific Node Description for HCA with\fR
\fB   GUID 0x0002c903000008d0 to " hca_test" :\fR
.PP
	#set_nodedesc.sh -H " hca_test" -G 0x0002c903000008d0
.PP
.nf
\fB4. Setting the HCA specific Node Description for HCA with GUID\fR
\fB   0x0002c903000008d0 to " hca_test1" and set the common node\fR
\fB   descriptor to "test1" :\fR
.PP
	#set_nodedesc.sh -H " hca_test" -G 0x0002c903000008d0 -N "test1"
.PP
.nf
\fB5. Read all Node descriptiors :\fR
.PP
	#set_nodedesc.sh -v
.PP
.nf
.sp
.SH "See Also"
.PP
