OpenIndiana/oi-userland/components/sendmail/files/man/check-permissions.8
'\" te
.\" Copyright (c) 2003, 2016, Oracle and/or its affiliates. All rights reserved.
.TH check-permissions 8 "8 Mar 2016" "SunOS 5.12" "System Administration Commands"
.SH NAME
check-permissions \- check permissions on mail rerouting files
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/check-permissions\fR [\fIlogin\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The  \fBcheck-permissions\fR script is intended as a migration aid for \fBsendmail\fR(8). It checks the \fB/etc/mail/sendmail.cf\fR file for all configured alias files, and checks the alias files for \fB:include:\fR files. It also checks for certain \fB\&.forward\fR files. For each file that  \fBcheck-permissions\fR checks, it verifies that none of the parent directories are group- or world-writable. If any directories are overly permissive, it is reported. Otherwise it reports that no unsafe directories were found.
.sp
.LP
As to which \fB\&.forward\fR files are checked, it depends on the arguments included on the command line. If no argument is given, the current user's home directory is checked for the presence of a  \fB\&.forward\fR file. If any arguments are given, they are assumed to be valid logins, and the home directory of each one is checked.
.sp
.LP
If the special argument \fBALL\fR is given,  the \fBpasswd\fR entry in the  \fB/etc/nsswitch.conf\fR file is checked, and all password entries that can be obtained through the switch file are checked. In large domains, this can be time-consuming.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fB\fIlogin\fR\fR
.ad
.RS 9n
.rt  
Where \fIlogin\fR is a valid user name, checks the home directory for  \fIlogin\fR. 
.RE

.sp
.ne 2
.mk
.na
\fB\fBALL\fR\fR
.ad
.RS 9n
.rt  
Checks the home directory of  \fBall\fR users.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/sendmail.cf\fR\fR
.ad
.RS 25n
.rt  
Defines environment for  \fBsendmail\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/aliases\fR\fR
.ad
.RS 25n
.rt  
Ascii mail aliases file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(7) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/smtp/sendmail
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBaliases\fR(5), \fBattributes\fR(7), \fBgetent\fR(8), \fBsendmail\fR(8)
