OpenIndiana/oi-userland/components/sendmail/files/man/sendmail.4
'\" te
.\" Copyright (c) 2008, 2011, Oracle and/or its affiliates. All rights reserved.
.TH sendmail 4 "28 Mar 2011" "SunOS 5.12" "File Formats"
.SH NAME
sendmail, sendmail.cf, submit.cf \- sendmail configuration files
.SH SYNOPSIS
.LP
.nf
\fB/etc/mail/sendmail.cf\fR
.fi

.LP
.nf
\fB/etc/mail/submit.cf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsendmail.cf\fR and \fBsubmit.cf\fR files are the configuration files for \fBsendmail\fR(1M). Starting with version 8.12 of \fBsendmail\fR, which was shipped with version 9 of the Solaris operating system, two configuration files are used for submission and transmission of mail, instead of only \fBsendmail.cf\fR, as before. These are:
.sp
.ne 2
.mk
.na
\fB\fBsendmail.cf\fR\fR
.ad
.RS 15n
.rt  
Remains the principal \fBsendmail\fR configuration file. Used for the Mail Transmission Agent (MTA).
.RE

.sp
.ne 2
.mk
.na
\fB\fBsubmit.cf\fR\fR
.ad
.RS 15n
.rt  
Used for the Mail Submission Program (MSP). The MSP is used to submit mail messages. Unlike the MTA, it does not run as an SMTP daemon.
.RE

.sp
.LP
The MSP does not require root privileges, thus the two-file model provides better security than the pre-\fBsendmail\fR 8.12 model, in which the MSP ran as a daemon and required root privileges.
.sp
.LP
In the default \fBsendmail\fR configuration, \fBsendmail\fR uses \fBsubmit.cf\fR, as indicated in \fBps\fR(1) output. In \fBps\fR output, you will observe two \fBsendmail\fR invocations, such as the ones below:
.sp
.in +2
.nf
/usr/lib/sendmail -Ac -q15m
/usr/lib/sendmail -bd -q15m
.fi
.in -2

.sp
.LP
The first indicates the use of \fBsubmit.cf\fR, with the client queue (\fB/var/spool/clientmqueue\fR) being checked\(emand, if needed, flushed\(emevery 15 minutes. The second invocation runs \fBsendmail\fR as a daemon, waiting for incoming SMTP connections.
.sp
.LP
As shipped, \fBsendmail.cf\fR and, in particular, \fBsubmit.cf\fR, are appropriate for most environments. Where a knowledgeable system administrator needs to make a change, he should use the following procedures.
.sp
.LP
For \fBsendmail.cf\fR:
.RS +4
.TP
1.
Change directories to the directory that contains the source files for the configuration files.
.sp
.in +2
.nf
# \fBcd /etc/mail/cf/cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Create a copy of the \fBsendmail\fR file for your system.
.sp
.in +2
.nf
# \fBcp sendmail.mc `hostname`.mc\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
Edit \fB`hostname`.mc\fR. Make changes suitable for your system and environment.
.RE
.RS +4
.TP
4.
Run \fBmake\fR to generate the configuration file.
.sp
.in +2
.nf
# \fB/usr/bin/make `hostname`.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
Copy the newly generated file to its correct location.
.sp
.in +2
.nf
# \fBcp `hostname`.cf /etc/mail/sendmail.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
6.
Restart the \fBsendmail\fR service.
.sp
.in +2
.nf
# \fBsvcadm restart sendmail\fR
.fi
.in -2
.sp

.RE
.sp
.LP
You must restart \fBsendmail\fR for \fBsendmail.cf\fR file changes to take effect, as indicated in step 6. Steps 4 - 6 can be automated. See \fBAutomated Rebuilding of Configuration Files\fR below.
.sp
.LP
For \fBsubmit.cf\fR:
.RS +4
.TP
1.
Change directories to the directory that contains the source files for the configuration files.
.sp
.in +2
.nf
# \fBcd /etc/mail/cf/cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Create a copy of the \fBsubmit\fR file for your system.
.sp
.in +2
.nf
# \fBcp submit.mc submit-`hostname`.mc\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
Edit \fBsubmit-`hostname`.mc\fR. Make changes suitable for your system and environment.
.RE
.RS +4
.TP
4.
Run \fBmake\fR to generate the configuration file.
.sp
.in +2
.nf
# \fB/usr/bin/make submit-`hostname`.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
Copy the newly generated file to its correct location.
.sp
.in +2
.nf
# \fBcp submit-`hostname`.cf /etc/mail/submit.cf\fR
.fi
.in -2
.sp

.RE
.sp
.LP
You do not need to restart \fBsendmail\fR for changes to \fBsubmit.cf\fR to take effect. Steps 4 and 5 can be automated. See \fBAutomated Rebuilding of Configuration Files\fR below.
.SS "Enabling Access to Remote Clients"
.sp
.LP
The \fBsendmail\fR(1M) man page describes how the \fBconfig/local_only\fR property can be set to \fBtrue\fR or \fBfalse\fR to disallow or allow, respectively, access to remote clients for unmodified systems. 
.SS "Automated Rebuilding of Configuration Files"
.sp
.LP
Setting a value for the:
.sp
.in +2
.nf
path_to_sendmail_mc
.fi
.in -2
.sp

.sp
.LP
property for the service instance:
.sp
.in +2
.nf
svc:/network/smtp:sendmail
.fi
.in -2
.sp

.sp
.LP
and setting a value for the:
.sp
.in +2
.nf
path_to_submit_mc
.fi
.in -2
.sp

.sp
.LP
for the service instance:
.sp
.in +2
.nf
svc:/network/sendmail-client:default
.fi
.in -2
.sp

.sp
.LP
results  in  automated (re)building of configuration files.
.sp
.LP
The value for each of these properties should be a string that represents the path name of the \fB\&.mc\fR files referred to in steps 2 and 3 of both procedures in the \fBDESCRIPTION\fR. Recommended values are:
.sp
.in +2
.nf
/etc/mail/cf/cf/`hostname`.mc
/etc/mail/cf/cf/submit-`hostname`.mc
.fi
.in -2
.sp

.sp
.LP
Each property, if set, results in the corresponding \fB\&.mc\fR file being used to (re)build the matching \fB\&.cf\fR file when the corresponding instance/service is started. 
.sp
.LP
These properties persist across upgrades and patches. To prevent a patch or upgrade from clobbering your \fB\&.cf\fR file, or renaming it to \fB\&.cf.old\fR, you can set the desired properties instead.
.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/mail/cf/README\fR\fR
.ad
.RS 23n
.rt  
Describes \fBsendmail\fR configuration files.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilityservice/network/smtp/sendmail
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBps\fR(1), \fBsendmail\fR(1M), \fBsvcadm\fR(1M), \fBmake\fR(1S), \fBattributes\fR(5)
.sp
.LP
\fISystem Administration Guide: Network Services\fR
